%% 参数定义
%注意：全程规定到底是用角度还是用弧度计算    
clear;
%节点数
n=5;%总节点数
n_pq=3;%PQ节点数
n_pv=1;%PV节点数
n_bal=1;%平衡节点数
%节点电压初值
X=zeros(2*n_pq+n_pv,1); %X=[Δsita,V_D2*ΔV]
V0=[1,1,1,1,1.05];      
sita0=[0,0,0,0,0]; %弧度
%导纳矩阵
G=[0.8381,-0.4044,0,0,-0.4337;
   -0.4044,0.7769,-0.3726,0,0;
   0,-0.3726,1.1428,-0.5224,-0.2739;
   0,0,-0.5224,0.5499,0;
   -0.4337,0,-0.2739,0,0.7077];
B=[-3.7899,1.6203,0,0,2.2586;
    1.6203,-3.4370,1.8557,0,0;
    0,1.8557,-7.0610,4.1792,1.2670;
    0,0,4.1792,-4.3991,0;
    2.2586,0,1.2670,0,-3.4837];
%各个节点的注入功率
P_s=[-0.22,-0.18,-0.27,0.35]; %在前的为PQ节点，在后的为PV节点
Q_s=[-0.14,-0.09,-0.13];
%迭代初值初始化
V=V0;
sita=sita0;
P=zeros(1,length(P_s));
Q=zeros(1,length(Q_s));
temp1=0;temp2=0;
deltaP=100;
deltaQ=100;
eps=1e-3;
%% 迭代求解
[V,sita,V_vis,sita_vis]=powerFlowNewtonCalcu(n,n_pq,n_pv,n_bal,V0,sita0,G,B,P_s,Q_s,eps);